backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - imgIn
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 248
      - 248
      - 3
      dtype: float32
      name: imgIn
      ragged: false
      sparse: false
    inbound_nodes: []
    name: imgIn
  - class_name: Lambda
    config:
      arguments: {}
      dtype: float32
      function: !!python/tuple
      - '4wEAAAAAAAAAAAAAAAEAAAABAAAAQwAAAHMEAAAAfABTACkBTqkAKQHaAXhyAQAAAHIBAAAAeh88

        aXB5dGhvbi1pbnB1dC0xOS00OThkMGUwOWQ2ZDg+2gg8bGFtYmRhPgMAAADzAAAAAA==

        '
      - null
      - null
      function_type: lambda
      module: __main__
      name: lambda_1
      output_shape: null
      output_shape_module: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - imgIn
        - 0
        - 0
        - {}
    name: lambda_1
  - class_name: Functional
    config:
      input_layers:
      - - input_2
        - 0
        - 0
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple
          - null
          - 248
          - 248
          - 3
          dtype: float32
          name: input_2
          ragged: false
          sparse: false
        inbound_nodes: []
        name: input_2
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 48
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: stem_conv
          padding: same
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - input_2
            - 0
            - 0
            - {}
        name: stem_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: stem_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - stem_conv
            - 0
            - 0
            - {}
        name: stem_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: stem_activation
          trainable: true
        inbound_nodes:
        - - - stem_bn
            - 0
            - 0
            - {}
        name: stem_activation
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          groups: 1
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block1a_dwconv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - stem_activation
            - 0
            - 0
            - {}
        name: block1a_dwconv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1a_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1a_dwconv
            - 0
            - 0
            - {}
        name: block1a_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block1a_activation
          trainable: true
        inbound_nodes:
        - - - block1a_bn
            - 0
            - 0
            - {}
        name: block1a_activation
      - class_name: GlobalAveragePooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block1a_se_squeeze
          trainable: true
        inbound_nodes:
        - - - block1a_activation
            - 0
            - 0
            - {}
        name: block1a_se_squeeze
      - class_name: Reshape
        config:
          dtype: float32
          name: block1a_se_reshape
          target_shape: !!python/tuple
          - 1
          - 1
          - 48
          trainable: true
        inbound_nodes:
        - - - block1a_se_squeeze
            - 0
            - 0
            - {}
        name: block1a_se_reshape
      - class_name: Conv2D
        config:
          activation: swish
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 12
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1a_se_reduce
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1a_se_reshape
            - 0
            - 0
            - {}
        name: block1a_se_reduce
      - class_name: Conv2D
        config:
          activation: sigmoid
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 48
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1a_se_expand
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1a_se_reduce
            - 0
            - 0
            - {}
        name: block1a_se_expand
      - class_name: Multiply
        config:
          dtype: float32
          name: block1a_se_excite
          trainable: true
        inbound_nodes:
        - - - block1a_activation
            - 0
            - 0
            - &id001 {}
          - - block1a_se_expand
            - 0
            - 0
            - *id001
        name: block1a_se_excite
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 24
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1a_project_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1a_se_excite
            - 0
            - 0
            - {}
        name: block1a_project_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1a_project_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1a_project_conv
            - 0
            - 0
            - {}
        name: block1a_project_bn
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          groups: 1
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block1b_dwconv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1a_project_bn
            - 0
            - 0
            - {}
        name: block1b_dwconv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1b_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1b_dwconv
            - 0
            - 0
            - {}
        name: block1b_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block1b_activation
          trainable: true
        inbound_nodes:
        - - - block1b_bn
            - 0
            - 0
            - {}
        name: block1b_activation
      - class_name: GlobalAveragePooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block1b_se_squeeze
          trainable: true
        inbound_nodes:
        - - - block1b_activation
            - 0
            - 0
            - {}
        name: block1b_se_squeeze
      - class_name: Reshape
        config:
          dtype: float32
          name: block1b_se_reshape
          target_shape: !!python/tuple
          - 1
          - 1
          - 24
          trainable: true
        inbound_nodes:
        - - - block1b_se_squeeze
            - 0
            - 0
            - {}
        name: block1b_se_reshape
      - class_name: Conv2D
        config:
          activation: swish
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 6
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1b_se_reduce
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1b_se_reshape
            - 0
            - 0
            - {}
        name: block1b_se_reduce
      - class_name: Conv2D
        config:
          activation: sigmoid
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 24
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1b_se_expand
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1b_se_reduce
            - 0
            - 0
            - {}
        name: block1b_se_expand
      - class_name: Multiply
        config:
          dtype: float32
          name: block1b_se_excite
          trainable: true
        inbound_nodes:
        - - - block1b_activation
            - 0
            - 0
            - &id002 {}
          - - block1b_se_expand
            - 0
            - 0
            - *id002
        name: block1b_se_excite
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 24
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1b_project_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1b_se_excite
            - 0
            - 0
            - {}
        name: block1b_project_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1b_project_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1b_project_conv
            - 0
            - 0
            - {}
        name: block1b_project_bn
      - class_name: FixedDropout
        config:
          dtype: float32
          name: block1b_drop
          noise_shape: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - null
            - 1
            - 1
            - 1
          rate: 0.0125
          seed: null
          trainable: true
        inbound_nodes:
        - - - block1b_project_bn
            - 0
            - 0
            - {}
        name: block1b_drop
      - class_name: Add
        config:
          dtype: float32
          name: block1b_add
          trainable: true
        inbound_nodes:
        - - - block1b_drop
            - 0
            - 0
            - &id003 {}
          - - block1a_project_bn
            - 0
            - 0
            - *id003
        name: block1b_add
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          groups: 1
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block1c_dwconv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1b_add
            - 0
            - 0
            - {}
        name: block1c_dwconv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1c_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1c_dwconv
            - 0
            - 0
            - {}
        name: block1c_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block1c_activation
          trainable: true
        inbound_nodes:
        - - - block1c_bn
            - 0
            - 0
            - {}
        name: block1c_activation
      - class_name: GlobalAveragePooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block1c_se_squeeze
          trainable: true
        inbound_nodes:
        - - - block1c_activation
            - 0
            - 0
            - {}
        name: block1c_se_squeeze
      - class_name: Reshape
        config:
          dtype: float32
          name: block1c_se_reshape
          target_shape: !!python/tuple
          - 1
          - 1
          - 24
          trainable: true
        inbound_nodes:
        - - - block1c_se_squeeze
            - 0
            - 0
            - {}
        name: block1c_se_reshape
      - class_name: Conv2D
        config:
          activation: swish
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 6
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1c_se_reduce
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1c_se_reshape
            - 0
            - 0
            - {}
        name: block1c_se_reduce
      - class_name: Conv2D
        config:
          activation: sigmoid
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 24
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1c_se_expand
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1c_se_reduce
            - 0
            - 0
            - {}
        name: block1c_se_expand
      - class_name: Multiply
        config:
          dtype: float32
          name: block1c_se_excite
          trainable: true
        inbound_nodes:
        - - - block1c_activation
            - 0
            - 0
            - &id004 {}
          - - block1c_se_expand
            - 0
            - 0
            - *id004
        name: block1c_se_excite
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 24
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block1c_project_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1c_se_excite
            - 0
            - 0
            - {}
        name: block1c_project_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block1c_project_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block1c_project_conv
            - 0
            - 0
            - {}
        name: block1c_project_bn
      - class_name: FixedDropout
        config:
          dtype: float32
          name: block1c_drop
          noise_shape: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - null
            - 1
            - 1
            - 1
          rate: 0.025
          seed: null
          trainable: true
        inbound_nodes:
        - - - block1c_project_bn
            - 0
            - 0
            - {}
        name: block1c_drop
      - class_name: Add
        config:
          dtype: float32
          name: block1c_add
          trainable: true
        inbound_nodes:
        - - - block1c_drop
            - 0
            - 0
            - &id005 {}
          - - block1b_add
            - 0
            - 0
            - *id005
        name: block1c_add
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 144
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2a_expand_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block1c_add
            - 0
            - 0
            - {}
        name: block2a_expand_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2a_expand_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2a_expand_conv
            - 0
            - 0
            - {}
        name: block2a_expand_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block2a_expand_activation
          trainable: true
        inbound_nodes:
        - - - block2a_expand_bn
            - 0
            - 0
            - {}
        name: block2a_expand_activation
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          groups: 1
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block2a_dwconv
          padding: same
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2a_expand_activation
            - 0
            - 0
            - {}
        name: block2a_dwconv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2a_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2a_dwconv
            - 0
            - 0
            - {}
        name: block2a_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block2a_activation
          trainable: true
        inbound_nodes:
        - - - block2a_bn
            - 0
            - 0
            - {}
        name: block2a_activation
      - class_name: GlobalAveragePooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block2a_se_squeeze
          trainable: true
        inbound_nodes:
        - - - block2a_activation
            - 0
            - 0
            - {}
        name: block2a_se_squeeze
      - class_name: Reshape
        config:
          dtype: float32
          name: block2a_se_reshape
          target_shape: !!python/tuple
          - 1
          - 1
          - 144
          trainable: true
        inbound_nodes:
        - - - block2a_se_squeeze
            - 0
            - 0
            - {}
        name: block2a_se_reshape
      - class_name: Conv2D
        config:
          activation: swish
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 6
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2a_se_reduce
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2a_se_reshape
            - 0
            - 0
            - {}
        name: block2a_se_reduce
      - class_name: Conv2D
        config:
          activation: sigmoid
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 144
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2a_se_expand
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2a_se_reduce
            - 0
            - 0
            - {}
        name: block2a_se_expand
      - class_name: Multiply
        config:
          dtype: float32
          name: block2a_se_excite
          trainable: true
        inbound_nodes:
        - - - block2a_activation
            - 0
            - 0
            - &id006 {}
          - - block2a_se_expand
            - 0
            - 0
            - *id006
        name: block2a_se_excite
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 40
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2a_project_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2a_se_excite
            - 0
            - 0
            - {}
        name: block2a_project_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2a_project_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2a_project_conv
            - 0
            - 0
            - {}
        name: block2a_project_bn
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 240
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2b_expand_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2a_project_bn
            - 0
            - 0
            - {}
        name: block2b_expand_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2b_expand_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2b_expand_conv
            - 0
            - 0
            - {}
        name: block2b_expand_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block2b_expand_activation
          trainable: true
        inbound_nodes:
        - - - block2b_expand_bn
            - 0
            - 0
            - {}
        name: block2b_expand_activation
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          groups: 1
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block2b_dwconv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2b_expand_activation
            - 0
            - 0
            - {}
        name: block2b_dwconv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2b_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2b_dwconv
            - 0
            - 0
            - {}
        name: block2b_bn
      - class_name: Activation
        config:
          activation: swish
          dtype: float32
          name: block2b_activation
          trainable: true
        inbound_nodes:
        - - - block2b_bn
            - 0
            - 0
            - {}
        name: block2b_activation
      - class_name: GlobalAveragePooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block2b_se_squeeze
          trainable: true
        inbound_nodes:
        - - - block2b_activation
            - 0
            - 0
            - {}
        name: block2b_se_squeeze
      - class_name: Reshape
        config:
          dtype: float32
          name: block2b_se_reshape
          target_shape: !!python/tuple
          - 1
          - 1
          - 240
          trainable: true
        inbound_nodes:
        - - - block2b_se_squeeze
            - 0
            - 0
            - {}
        name: block2b_se_reshape
      - class_name: Conv2D
        config:
          activation: swish
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 10
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2b_se_reduce
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2b_se_reshape
            - 0
            - 0
            - {}
        name: block2b_se_reduce
      - class_name: Conv2D
        config:
          activation: sigmoid
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 240
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2b_se_expand
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2b_se_reduce
            - 0
            - 0
            - {}
        name: block2b_se_expand
      - class_name: Multiply
        config:
          dtype: float32
          name: block2b_se_excite
          trainable: true
        inbound_nodes:
        - - - block2b_activation
            - 0
            - 0
            - &id007 {}
          - - block2b_se_expand
            - 0
            - 0
            - *id007
        name: block2b_se_excite
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 40
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2b_project_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2b_se_excite
            - 0
            - 0
            - {}
        name: block2b_project_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block2b_project_bn
          scale: true
          trainable: true
        inbound_nodes:
        - - - block2b_project_conv
            - 0
            - 0
            - {}
        name: block2b_project_bn
      - class_name: FixedDropout
        config:
          dtype: float32
          name: block2b_drop
          noise_shape: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - null
            - 1
            - 1
            - 1
          rate: 0.05
          seed: null
          trainable: true
        inbound_nodes:
        - - - block2b_project_bn
            - 0
            - 0
            - {}
        name: block2b_drop
      - class_name: Add
        config:
          dtype: float32
          name: block2b_add
          trainable: true
        inbound_nodes:
        - - - block2b_drop
            - 0
            - 0
            - &id008 {}
          - - block2a_project_bn
            - 0
            - 0
            - *id008
        name: block2b_add
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 240
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: truncated_normal
              mode: fan_out
              scale: 2.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block2c_expand_conv
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: false
        inbound_nodes:
        - - - block2b_add
            - 0
            - 0
            - {}
        name: block2c_expand_conv
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
